# -*- coding: utf-8 -*-
"""
-------------------------------------------------
@version    : v1.0
@author     : fangzheng
@contact    : fangzheng@rp-pet.cn
@software   : PyCharm
@filename   : util_area.py
@create time: 2024/2/21 3:09 PM
@modify time: 2024/2/21 3:09 PM
@describe   : 
-------------------------------------------------
"""

areas = [
    {"province": "北京", "citys": ["北京"]},
    {"province": "安徽",
     "citys": ['合肥', '芜湖', '蚌埠', '淮南', '马鞍山', '淮北', '铜陵', '安庆', '黄山', '滁州', '阜阳', '宿州', '六安', '亳州', '池州',
               '宣城']},
    {"province": "甘肃",
     "citys": ['兰州', '嘉峪关', '金昌', '白银', '天水', '武威', '张掖', '平凉', '酒泉', '庆阳', '定西', '陇南', '临夏回族自治州',
               '甘南藏族自治州']},
    {"province": "福建", "citys": ['福州', '厦门', '莆田', '三明', '泉州', '漳州', '南平', '龙岩', '宁德']},
    {"province": "广东",
     "citys": ['广州', '韶关', '深圳', '珠海', '汕头', '佛山', '江门', '湛江', '茂名', '肇庆', '惠州', '梅州', '汕尾', '河源', '阳江',
               '清远', '东莞', '中山', '东沙群岛', '潮州', '揭阳', '云浮']},
    {"province": "广西壮族自治区",
     "citys": ['南宁', '柳州', '桂林', '梧州', '北海', '防城港', '钦州', '贵港', '玉林', '百色', '贺州', '河池', '来宾', '崇左']},
    {"province": "贵州",
     "citys": ['贵阳', '六盘水', '遵义', '安顺', '铜仁', '黔西南布依族苗族自治州', '毕节', '黔东南苗族侗族自治州', '黔南布依族苗族自治州']},
    {"province": "海南",
     "citys": ['海口', '三亚', '三沙', '五指山', '琼海', '儋州', '文昌', '万宁', '东方', '白沙黎族自治县', '昌江黎族自治县', '乐东黎族自治县',
               '陵水黎族自治县', '琼中黎族苗族自治县', '昌江黎族自治县', '乐东黎族自治县', '陵水黎族自治县', '保亭黎族苗族自治县', '琼中黎族苗族自治县']},
    {"province": "河北", "citys": ['石家庄', '唐山', '秦皇岛', '邯郸', '邢台', '保定', '张家口', '承德', '沧州', '廊坊', '衡水']},
    {"province": "河南",
     "citys": ['郑州', '开封', '洛阳', '平顶山', '安阳', '鹤壁', '新乡', '焦作', '济源', '濮阳', '许昌', '漯河', '三门峡', '南阳',
               '商丘', '信阳', '周口', '驻马店']},
    {"province": "黑龙江",
     "citys": ['哈尔滨', '齐齐哈尔', '鸡西', '鹤岗', '双鸭山', '大庆', '伊春', '佳木斯', '七台河', '牡丹江', '黑河', '绥化', '大兴安岭地区']},
    {"province": "湖北",
     "citys": ['武汉', '黄石', '十堰', '宜昌', '襄阳', '鄂州', '荆门', '孝感', '荆州', '黄冈', '咸宁', '随州', '恩施土家族苗族自治州', '仙桃',
               '潜江', '天门', '神农架林区']},
    {"province": "湖南",
     "citys": ['长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德', '张家界', '益阳', '郴州', '永州', '怀化', '娄底',
               '湘西土家族苗族自治州']},
    {"province": "吉林", "citys": ['长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '延边朝鲜族自治州']},
    {"province": "江苏",
     "citys": ['南京', '无锡', '徐州', '常州', '苏州', '南通', '连云港', '淮安', '盐城', '扬州', '镇江', '泰州', '宿迁']},
    {"province": "江西", "citys": ["南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"]},
    {"province": "辽宁",
     "citys": ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"]},
    {"province": "内蒙古自治区",
     "citys": ["呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安盟", "锡林郭勒盟", "阿拉善盟"]},
    {"province": "宁夏回族自治区", "citys": ["银川", "石嘴山", "吴忠", "固原", "中卫"]},
    {"province": "青海", "citys": ["西宁", "海东", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"]},
    {"province": "山东",
     "citys": ["济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城",
               "滨州", "菏泽"]},
    {"province": "山西", "citys": ["太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁"]},
    {"province": "陕西", "citys": ["西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛"]},
    {"province": "上海", "citys": ["上海"]},
    {"province": "四川",
     "citys": ["成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "达州",
               "雅安", "巴中", "资阳", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"]},
    {"province": "台湾",
     "citys": ["台北", "高雄", "台南", "台中", "金门县", "南投县", "基隆", "新竹", "嘉义", "新北", "宜兰县", "新竹县", "桃园县", "苗栗县", "彰化县",
               "嘉义县", "云林县", "屏东县", "台东县", "花莲县", "澎湖县", "连江县"]},
    {"province": "天津", "citys": ["天津"]},
    {"province": "西藏自治区", "citys": ["拉萨", "昌都地区", "山南地区", "日喀则地区", "那曲地区", "阿里地区", "林芝地区"]},
    {"province": "香港特别行政区", "citys": ["香港岛", "九龙", "新界"]},
    {"province": "新疆维吾尔自治区",
     "citys": ["乌鲁木齐", "克拉玛依", "吐鲁番地区", "哈密地区", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州",
               "喀什地区", "和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "石河子", "阿拉尔", "图木舒克", "五家渠"]},
    {"province": "云南",
     "citys": ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州",
               "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"]},
    {"province": "浙江", "citys": ["杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"]},
    {"province": "重庆", "citys": ["重庆"]}
]


def all_province():
    provinces = []
    for province in areas:
        provinces.append(province['province'])
    return provinces


def get_city_by_province(province_name):
    for province in areas:
        p_name = province['province']
        if province_name == p_name:
            return province['citys']

if __name__ == '__main__':
    print(all_province())
    # print(get_city_by_province("河南省"))